app/Controllers/Sekolah.php

SELECT *
FROM `sekolah`
ORDER BY `id_sekolah` ASC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `sekolah`
---
    public function index()
    {
        $model = new \App\Models\SekolahModel();

        $perPage = 10;
        $page    = (int) ($this->request->getVar('page_ sekolah') ?? 1);

        // Ambil parameter pencarian & sorting
        $q     = trim($this->request->getGet('q') ?? '');
        $sort  = $this->request->getGet('sort') ?? 'id_sekolah';
        $order = $this->request->getGet('order') ?? 'asc';

        // Whitelist kolom sorting untuk keamanan
        $allowedSort = ['id_sekolah','nama_sekolah','email','no_telfon'];
        if (! in_array($sort, $allowedSort)) {
            $sort = 'id_sekolah';
        }
        $order = strtolower($order) === 'desc' ? 'desc' : 'asc';

        // Jika ada query pencarian, tambahkan kondisi LIKE (nama/email/no_telfon)
        if ($q !== '') {
            $model = $model->groupStart()
                        ->like('nama_sekolah', $q)
                        ->orLike('email', $q)
                        ->orLike('no_telfon', $q)
                        ->groupEnd();
        }

        // Ambil data dengan sorting & paginate
        $data['sekolah'] = $model->orderBy($sort, $order)
                                ->paginate($perPage, 'sekolah');